CSI API ETABS v1
cFrameObj.SetInsertionPoint Method
 Assigns frame object insertion point data. The assignments include the cardinal point and end joint offsets.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetInsertionPoint(
	string Name,
	int CardinalPoint,
	bool Mirror2,
	bool StiffTransform,
	ref double[] Offset1,
	ref double[] Offset2,
	string CSys = "Local",
	eItemType ItemType = eItemType.Objects
)
Function SetInsertionPoint (
	Name As String,
	CardinalPoint As Integer,
	Mirror2 As Boolean,
	StiffTransform As Boolean,
	ByRef Offset1 As Double(),
	ByRef Offset2 As Double(),
	Optional CSys As String = "Local",
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cFrameObj
Dim Name As String
Dim CardinalPoint As Integer
Dim Mirror2 As Boolean
Dim StiffTransform As Boolean
Dim Offset1 As Double()
Dim Offset2 As Double()
Dim CSys As String
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetInsertionPoint(Name,
	CardinalPoint, Mirror2, StiffTransform,
	Offset1, Offset2, CSys, ItemType)
int SetInsertionPoint(
	String^ Name,
	int CardinalPoint,
	bool Mirror2,
	bool StiffTransform,
	array<double>^% Offset1,
	array<double>^% Offset2,
	String^ CSys = L"Local",
	eItemType ItemType = eItemType::Objects
)
abstract SetInsertionPoint :
        Name : string *
        CardinalPoint : int *
        Mirror2 : bool *
        StiffTransform : bool *
        Offset1 : float[] byref *
        Offset2 : float[] byref *
        ?CSys : string *
        ?ItemType : eItemType
(* Defaults:
        let _CSys = defaultArg CSys "Local"
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing frame object or group, depending on the value of the ItemType item.
CardinalPoint
Type: System.Int32
 This is a numeric value from 1 to 11 that specifies the cardinal point for the frame object. The cardinal point specifies the relative position of the frame section on the line representing the frame object.
bottom left
bottom center
bottom right
middle left
middle center
middle right
top left
top center
top right
centroid
shear center
Mirror2
Type: System.Boolean
 If this item is True, the frame object section is assumed to be mirrored (flipped) about its local 2-axis.
StiffTransform
Type: System.Boolean
 If this item is True, the frame object stiffness is transformed for cardinal point and joint offsets from the frame section centroid.
Offset1
Type: System.Double[]
 This is an array of three joint offset distances, in the coordinate directions specified by CSys, at the I-End of the frame object. [L]
Offset1(0) = Offset in the 1-axis or X-axis direction
Offset1(1) = Offset in the 2-axis or Y-axis direction
Offset1(2) = Offset in the 3-axis or Z-axis direction
Offset2
Type: System.Double[]
 This is an array of three joint offset distances, in the coordinate directions specified by CSys, at the J-End of the frame object. [L]
Offset2(0) = Offset in the 1-axis or X-axis direction
Offset2(1) = Offset in the 2-axis or Y-axis direction
Offset2(2) = Offset in the 3-axis or Z-axis direction
CSys (Optional)
Type: System.String
 This is Local or the name of a defined coordinate system. It is the coordinate system in which the Offset1 and Offset2 items are specified.
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, the assignment is made to the frame object specified by the Name item.
 If this item is Group, the assignment is made to all frame objects in the group specified by the Name item.
 If this item is SelectedObjects, the assignment is made to all selected frame objects and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the insertion point data is successfully assigned, otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim i As integer
   Dim Offset1() As Double
   Dim Offset2() As Double
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'assign frame insertion point
   ReDim Offset1(2)
   ReDim Offset2(2)
   For i=0 To 2
      Offset1(i)=10 + i
      Offset2(i)=20 + i
   Next i
   ret = SapModel.FrameObj.SetInsertionPoint("15", 7, False, True, Offset1, Offset2)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cFrameObj Interface
ETABSv1 Namespace